[
  {
    "title": "Бот должен скидывать в личным сообщением комментарии к пуллреквесту автору пуллреквеста",
    "description": "1) В конфиге бота указываем данные для интеграции с bitbucket. Логин автора в bitbucket и dialog является одинаковым. \r\n2) Бот отслеживает появление всех новых комментариев к пуллреквестам проекта\r\n3) При появлении нового комментария к пуллреквесту бот публикует в личном сообщении автору пуллреквеста сообщение. Сообщение состоит из текста комментария и ссылки на на пуллреквест.",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-bitbucket-bot] Бот-напоминалка о висящих пулл реквестах",
    "description": "1) В конфиге бота указываем данные для интеграции с bitbucket. Логин автора в bitbucket и dialog является одинаковым. \r\n2) Пользователь в личном сообщении боту активирует бота\r\n3) Пользователь в личном сообщении боту выбирает время напоминания о висящих пуллреквестах\r\n4) Раз в день в указанное время от бота приходит оповещение с заголовками нерассмотренных пуллркевестов, которые должен рассмотреть пользователь и ссылки на них в битбакете.",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-testrail-bot] Прогон тесткейсов из testrail в чате",
    "description": "Работа с тестрейлом осуществляется через TestRail API - http://docs.gurock.com/testrail-api2/start ( доступные языки в ассортименте )\r\n\r\n1. Пользователь начинает общение с ботом ( /start )\r\n2. Бот присылает пользователю список доступных для выбора тест-сьютов ( get_suites )\r\n3. Пользователь выбирает сьют ( кнопкой или сообщением с номером )\r\n4. Бот создает тест-ран ( add_run ) по выбранному пользователем тест-сьюту\r\n5. Бот получает тесты ( get_tests ) из созданного в предыдущем шаге тест-рана\r\n6. Бот присылает пользователю первый тест ( get_test ) ⁣ ⁣и набор кнопок, каждая из котрых отправляет тот или иной результат ( add_result ) для текущего теста- // набор информативных полей теста зависит от целей тестирования, скорее всего это будут поля «content» и «expected». Набор доступных результатов тоже )\r\n7. Пользователь выбирает и кликает на одну из кнопок\r\n8. Бот присылает пользователю следующий тест\r\n9. ++ пока не будут пройдены все тесты\r\n10. Бот формирует итоговый отчет , закрывает тест-ран ( close_run) и присылает пользователю файлик ( вид и формат отчета - по вкусу )",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-jira-bot] Джарвис, чем я сейчас занимаюсь в джире?",
    "description": "1) В конфиге бота указываем данные для интеграции с jira. Логин автора в jira и dialog является одинаковым. \r\n2) Пользователь пишет боту в личном или групповом чате сообщение \"Джарвис, чем я сейчас занимаюсь?\"\r\n3) Бот присылает в чат сообщение с названием каждого назначенного на пользователя таска в состоянии \"in progress\". Каждый таск является строкой в сообщении. Каждая строка оформлена по формату \"Time in progress - [PROJECT_CODE-TASK_ID](https://jira.domain.com/browse/PROJECT_CODE-TASK_ID) Title\".",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-jira-bot] Бот, который присылает список участников команды с in progress тасками на нем и временем в работе",
    "description": "1) В конфиге бота указываем данные для интеграции с jira. Логин автора в jira и dialog является одинаковым. \r\n2) Пользователь пишет боту в личном или групповом чате сообщение \"Чем занята команда?\"\r\n3) Бот присылает в чат сообщение с список участников команды с in progress тасками на нем и временем в работе. Каждый пользователь является разделен строкой. Для каждого пользователя выводится построчный список тасков. Каждая строка оформлена по формату \"Time in progress - [PROJECT_CODE-TASK_ID](https://jira.domain.com/browse/PROJECT_CODE-TASK_ID) Title\".",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-jira-bot] Бот, который уведомляет об изменении таска в джире",
    "description": "1) В конфиге бота указываем данные для интеграции с jira. \r\n2) Пользователь пишет боту в личном или групповом чате сообщение \"Напоминай про [PROJECT_CODE-TASK_ID]\" \r\n3) Каждый раз, когда статус таска в джире изменяется, бот пишет пользователю сообщение в формате \" *STATUS* - [PROJECT_CODE-TASK_ID](https://jira.domain.com/browse/PROJECT_CODE-TASK_ID) Title\"\r\n4) Пользователь может остановить отслеживание таска, написав в личном или групповом чате сообщение \"Не напоминай про [PROJECT_CODE-TASK_ID]\"",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-jira-bot] Создавать таски в джире через бота",
    "description": "1) В конфиге бота указываем данные для интеграции с jira. Логин автора в jira и dialog является одинаковым. \r\n2) Пользователь пишет боту в личном или групповом чате сообщение с текстом таска\r\n3) Бот присылает дропдаун меню, которое содержит проекты в котором можно создать бота и кнопку стоп\r\n4.1) Пользователь выбирает пункт из меню\r\n4.2) Пользователь выбирает кнопку stop и сбрасывает процесс создания таска\r\n5) Если 4.1 то бот создает таск и присылает текст \"[PROJECT_CODE-TASK_ID](https://jira.domain.com/browse/PROJECT_CODE-TASK_ID) Title\"\r\n6) Любой Пользователь присылает текст или файл/скриншот в ответ на соощение 5\r\n7) Бот добавляет в комментарии к этому таску этот текст или файл/скриншот\r\n",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "Накинем таску сделать вот такую штуку. Эквалайзер медиастрима. Довольно простенько, подходит под задачку для либки.",
    "description": "СПРОСИТЬ С ДЕМИНА ИЛИ СКРОБОТА",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-office-bot] Запросить доступное окно человека в Google Calendar, чтобы поставить встречу",
    "description": "1) В конфиге бота указываем данные для интеграции с G Suite. Логин автора в google и dialog является одинаковым. \r\n\r\n\r\nСПРОСИТЬ С ДОВГОПОЛОВОЙ",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-office-bot] Выгружать запланированные отпуска из BambooHR",
    "description": "1) В конфиге бота указываем данные для интеграции с G Suite. Логин автора в google и dialog является одинаковым. \r\n2) Пользователь пишет боту команду \"Календарь отпусков\"\r\n3) Бот присылает пользователю текстом список заголовков всех ивентов в календаре. Каждый ивент на отдельной строке. От самого близкого до самого дальнего. \r\n4) Пользователь пишет боту команду \"Отпуски в МЕСЯЦ\"\r\n5) Бот присылает пользователю текстом список заголовков всех ивентов в календаре за указанный месяц. Каждый ивент на отдельной строке. От самого близкого до самого дальнего. \r\n",
    "link": "https://github.com/dialogs",
    "isDone": true
  },
  {
    "title": "[dialog-reminder-bot] Бот, который помогать не пропустить твои меншены во нужных чатах",
    "description": "1) Добавляем бота в групповые чаты, в которых бод должен следить за меншенами\r\n2) В личных сообщениях у бота включаем отслеживание меншенов на мой логин\r\n3) В личных сообщениях у бота включаются и выключаются чаты, в которых надо отслеживать упоминания для данного пользователя. Бот должен сам детектить, в какие чаты он добавлен и предлагать эти чаты в своих настройках.\r\n4) В личных сообщениях у бота указываем в какое время бод должен присылать сводку упоминаний\r\n5) В указанное время бот присылает оповещение по всем меншенам пользователя за день в каждом чате. Каждое сообщение должно быть оформлено либо форвардом, либо содержать ссылку на переход к оригинальному сообщению. Сообщения должны быть сгрупированы по группам.\r\n4) Пользователь пишет боту команду \"Отпуски в QX\" где X - это номер квартала. 1 - январь, февраль, март; 2 - апрель, май, июнь; 3 - июль, август, сентябрь; 4 - октябрь, ноябрь, декабрь.\r\n5) Бот присылает пользователю текстом список заголовков всех ивентов в календаре за указанный кварталь. Каждый ивент на отдельной строке. От самого близкого до самого дальнего.",
    "link": "https://github.com/dialogs",
    "isDone": false
  },
  {
    "title": "[dialog-okr-bot] Бот ОКР команды и личный, показывает список и статус достижения",
    "description": "1) В конфиге бота указываем данные для интеграции с gtmhub.com. Логин автора в gtmhub.com и dialog является одинаковым. \r\n2.1) Пользователь пишет боту в личное собщение \"Мои OKR [название_списка]\"\r\n2.2) Бот присылает пользователю его цели из указанного списка в сообщении в формате:\r\n[Цель 1](ссылка на цель) - процент выполнения\r\n[Название ключевого результата](ссылка на ключевой результат) - значение - *процент выполнения*- кнопка \"Обновить\"\r\n...\r\n[Ключевой результатX](ссылка на ключевой результат) - значение - *процент выполнения*- кнопка \"Обновить\"\r\n\r\n[Цель X](ссылка на цель) - процент выполнения\r\n[Название ключевого результата](ссылка на ключевой результат) - значение - *процент выполнения*- кнопка \"Обновить\"\r\n...\r\n[Ключевой результатX](ссылка на ключевой результат) - значение - *процент выполнения*- кнопка \"Обновить\"\r\n3.1) Пользователь пишет боту в личное собщение \"OKR @username [название_списка]\"\r\n3.2) Бот присылает пользователю цели указанного пользователя из указанного списка в сообщении в формате:\r\n[Цель 1](ссылка на цель) - процент выполнения\r\n[Название ключевого результата](ссылка на ключевой результат) - значение - *процент выполнения*\r\n...\r\n[Ключевой результатX](ссылка на ключевой результат) - значение - *процент выполнения*\r\n\r\n[Цель X](ссылка на цель) - процент выполнения\r\n[Название ключевого результата](ссылка на ключевой результат) - значение - *процент выполнения*\r\n4.1) Пользователь кликает на \"Обновить\" в одном из своих ключевых результатов\r\n4.2) Бот присылает пользователю сообщение в формате:\r\nНазвание ключевого результата\r\nCейчас - *текущее_значение_ключевого_результата*\r\nДолжно быть - *целевое_значение_ключевого_результата*\r\nУкажите новое значение\r\n4.3) Пользователь отправляет цифровое значение. Если значение не подходит по формату, бот просит указать корректное значение.\r\n4.4) Бот присылает пользователю сообщение в формате: \"Что поменялось? Почему?\"\r\n4.5) Пользователь отправляет любое текстовое сообщение.\r\n4.6) Бот присылает пользователю сообщение в формате: \"Укажите уровень уверенности в результате [дропдаун_со_всеми_возможными_результатами]\"\r\n4.7) Пользователь выбирает результат\r\n4.8) Бот присылает пользователю сообщение в формате: \r\n[Ключевой результат](ссылка на ключевой результат) - новый процент выполнения \r\nКнопка \"Отправить\", Кнопка \"Отменить\"\r\n4.9.1) Пользователь выбирает \"отправить\" и бот отправляет новые значения в gtmhub.\r\n4.9.2) Бот присылает пользователю сообщение в формате: \"Результат обновлен\" \r\n4.10.1) Пользователь выбирает \"Отменить\" и бот сбрасывает все поля. На любом предыдущем этапе пользователь вместо нажатия кнопки может отправить \"/stop\".\r\n4.10.1) Бот присылает пользователю сообщение в формате: \"Ввод результатов сброшен\" \r\n",
    "link": "https://github.com/dialogs",
    "isDone": false
  }
]
